<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"fe81047259153bfce2e0e554d9717f122fe57b37120d09893fd00d4c76217486","plan_job_ref":"Job Staging Environment #106 at https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/12973790112","plan_out_hash":"9c7ab19018a8d197181215ae8cfef5aac612bdb9c9342853291c1b640d942157","plan_hash":"c0117cb4e9bc7ea19ee4cf936ccaa524b0c0afeeb3bd2d6704224b122857a218","plan_text_format":"diff","version":"1.46.1","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 1 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site-iam-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site-iam-policy" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::dev-portfolio-website-2.0",
+               "arn:aws:s3:::dev-portfolio-website-2.0/*",
            ]
+           sid       = "Allowing Cloudfront to access private S3 Bucket"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ",
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # aws_acm_certificate.site-cert will be created
+   resource "aws_acm_certificate" "site-cert" {
+       arn                       = (known after apply)
+       domain_name               = "dev.dennisowie.com"
+       domain_validation_options = (known after apply)
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "dev.dennisowie.com",
        ]
+       tags_all                  = {
+           "Environment" = "Dev Environment"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "EMAIL"

+       options (known after apply)
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "EOUIG3G6N7CQQ"
        tags                            = {}
#        (23 unchanged attributes hidden)

!~      viewer_certificate {
!~          acm_certificate_arn            = "arn:aws:acm:us-east-1:806066816337:certificate/2df558c4-3a7e-45cc-b330-f971936262f2" -> (known after apply)
!~          cloudfront_default_certificate = false -> true
!~          minimum_protocol_version       = "TLSv1.2_2021" -> "TLSv1"
#            (2 unchanged attributes hidden)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.site-bucket-policy will be updated in-place
!~  resource "aws_s3_bucket_policy" "site-bucket-policy" {
        id     = "dev-portfolio-website-2.0"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "s3:ListBucket",
-                           "s3:GetObject",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "AWS:SourceArn" = "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::dev-portfolio-website-2.0/*",
-                           "arn:aws:s3:::dev-portfolio-website-2.0",
                        ]
-                       Sid       = "Allowing Cloudfront to access private S3 Bucket"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # aws_s3_object.cert will be updated in-place
!~  resource "aws_s3_object" "cert" {
!~      etag                          = "da23af711c3e6200e1b72dcfe729cb3d" -> "731b968003f019cde28f72bd699371af"
        id                            = "cert.html"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Staging Environment #106](https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/12973790112)